/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   here_doc.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: idongmin <idongmin@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/10 02:17:37 by idongmin          #+#    #+#             */
/*   Updated: 2022/05/10 02:45:51 by idongmin         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../include/minishell.h"

//1. here_doc 들어 왔을 때, 해당 파일 만들기
//2. 파일 명과 일치 할 때, 해당 

int	here_doc_test(t_here here, int argc, char **argv, char **envp)
{
	return (1);
}
